src/bsl/Catalogs/гкс_НастройкиИнтеграцииWarehouse.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>гкс_НастройкиИнтеграцииWarehouse</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоНеудачныхОбработок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерПорцииОбработки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтанцияНазначения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_КлассификаторСтанцийЖД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерПорцииОбработкиОчистки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокХранениеВнешнихПроб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокХранениеВходящихДанныхWarehouse</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокХранениеИсторииИзмененияВнешнихПроб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтборПоОрганизации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/bsl/Catalogs/гкс_НастройкиИнтеграцииWarehouse/Ext/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция НастройкиИнтеграции() Экспорт
	
	ТекЭлемент 	= Справочники.гкс_НастройкиИнтеграцииWarehouse.ПоУмолчанию;	
	Реквизиты 	= ИнициализироватьСтруктураЭлемента();
	
	Возврат гкс_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекЭлемент, Реквизиты);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИнициализироватьСтруктураЭлемента() Экспорт
	
	СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("КоличествоНеудачныхОбработок", 			0);
	СтруктураНастройки.Вставить("РазмерПорцииОбработки", 					0);
	СтруктураНастройки.Вставить("СрокХранениеВходящихДанныхWarehouse", 		0);
	СтруктураНастройки.Вставить("СрокХранениеВнешнихПроб", 					0);
	СтруктураНастройки.Вставить("СрокХранениеИсторииИзмененияВнешнихПроб", 	0);
	СтруктураНастройки.Вставить("РазмерПорцииОбработкиОчистки", 			0);
	СтруктураНастройки.Вставить("ОтборПоОрганизации", 						ИнициализироватьТабличнуюЧасть());
	
	Возврат СтруктураНастройки;

КонецФункции

Функция ИнициализироватьТабличнуюЧасть()
	
	ТЗОрганизации = Новый ТаблицаЗначений;
	ТЗОрганизации.Колонки.Добавить("Организация");
	
	Возврат ТЗОрганизации;

КонецФункции

#КонецОбласти

#КонецЕсли
